package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        int day = 8;
        int month = 4;
        int year = 2015;

        System.out.println("0" + day + " " + "0" + month + " " + year);//Напишите тут ваш код
    }
}
